/* AGO 한국어 문자열 (T-AGO-20) */

/* 드롭존 */
"drop.title" = ".app을 여기로 드래그";
"drop.subtitle" = "차단 해제 → 검증 → 실행을 한 흐름으로";
"drop.choose" = "파일 선택…";
"drop.chooseAnother" = "다른 앱 선택…";
"drop.clearHelp" = "선택 해제";
"drop.version" = "버전 %@";
"drop.panelMessage" = ".app 번들을 선택해 주세요";

/* 타임라인 */
"step.check" = "확인";
"step.clean" = "제거";
"step.verify" = "검증";
"step.run" = "실행";

/* 터미널 로그 */
"log.title" = "진행 로그";
"log.copied" = "복사됨";
"log.copy" = "복사";
"log.copyHelp" = "로그 전체 복사";
"log.empty" = "앱을 드래그하면 여기에 진행 로그가 표시됩니다.";

/* 판정 카드 */
"verdict.passTitle" = "검사 통과";
"verdict.passBody" = "서명 정상 · Gatekeeper 통과 — 실행 버튼을 눌러 여세요";
"verdict.tamperedTitle" = "변조 의심 — %d개 파일 추가·수정됨";
"verdict.devTitle" = "Gatekeeper 미승인 서명 (개발용)";
"verdict.brokenTitle" = "서명 검증 실패";
"verdict.advice" = "공식 출처에서 다시 받는 것을 권장합니다";
"verdict.moreFiles" = "외 %d개 — 로그에서 전체 확인";
"verdict.acknowledge" = "위험을 알고 실행합니다";
"verdict.cannotRun" = "Gatekeeper 거부로 실행할 수 없습니다";
"verdict.provenance" = "macOS 26+ 출처 속성도 함께 제거했습니다 — 실행 시 확인 창 방지";

/* 도움말 */
"help.title" = "열어줘 도움말";
"help.close" = "닫기";
"help.s1t" = "왜 필요한가요?";
"help.s1b" = "인터넷에서 받은 앱에는 차단 속성(com.apple.quarantine)이 붙어 바로 실행되지 않습니다. macOS 26부터는 출처 속성(com.apple.provenance) 때문에 실행 시에 확인 창이 다시 뜰 수도 있습니다. AGO는 차단·출처 속성 해제 → 서명 검증 → Gatekeeper 평가 → 실행을 한 흐름으로 끝냅니다.";
"help.s2t" = "사용 절차";
"help.s2b" = "1. .app을 드래그하거나 ⌘O로 선택\n2. 파이프라인이 자동으로 검사 (확인 → 제거 → 검증)\n3. 통과하면 실행 버튼, 경고가 뜨면 내용 확인 후 체크박스 선택";
"help.s3t" = "경고의 의미";
"help.s3b" = "빨간 경고는 앱 서명과 실제 파일이 다르다는 뜻입니다. 업데이트 과정에서 생기기도 하지만 악성 변조일 수도 있어 공식 출처에서 다시 받는 것이 가장 안전합니다.";
"help.s4t" = "하지 않는 일";
"help.s4b" = "익명 재서명(adhoc) 없음 · 개발 신원 서명은 확인 후에만 · sudo 자동 승격 없음 · .dmg 처리 없음(v1 범위 밖) · 확인 없는 자동 실행 없음";
"help.madeBy" = "제작 BoRaSaRang";
"help.contact" = "문의하기";

/* 앱 */
"app.run" = "앱 실행";
"app.runHelpBlocked" = "경고 카드를 확인하고 체크박스를 선택하세요";
"app.runHelpReady" = "검사 통과한 앱 실행";
"app.cancel" = "취소";
"app.help" = "도움말";
"app.quit" = "종료";
"app.contact" = "문의하기";
"app.quitting" = "자동으로 종료됩니다… %d";
"menu.open" = "열기…";

/* 상태 */
"status.idle" = "대기";
"status.inspecting" = "검사 중";
"status.cleaning" = "차단 해제 중";
"status.verifying" = "검증 중";
"status.ready" = "준비됨";
"status.blocked" = "경고";

/* 파이프라인 로그 */
"pipe.start" = "검사 시작: %@";
"pipe.stampsFound" = "차단 속성 항목 %d개 감지 (폴더 전체 재귀 검사)";
"pipe.noQuarantine" = "차단 속성 없음 — 제거 단계 생략";
"pipe.removed" = "차단 속성 제거됨";
"pipe.provenanceFound" = "macOS 출처 속성 감지 — com.apple.provenance";
"pipe.provenanceRemoved" = "출처 속성 제거됨 (com.apple.provenance)";
"pipe.maclFound" = "권한 귀속 속성 감지 — com.apple.macl";
"pipe.maclRemoved" = "권한 귀속 속성 제거됨 (com.apple.macl)";
"pipe.formatOK" = "형식 검사 통과: %@";
"pipe.signOK" = "서명 정상 (valid on disk)";
"pipe.tampered" = "변조 의심: %d개 파일 추가·수정됨";
"pipe.signFail" = "서명 검증 실패: %@";
"pipe.spctlOK" = "Gatekeeper 평가 통과 (accepted)";
"pipe.ready" = "준비됨 — 실행 버튼을 눌러 앱을 여세요";
"pipe.warnTampered" = "경고 — 변조 의심. 내용을 확인하고 체크박스 선택 후 실행하세요";
"pipe.devSig" = "개발용 서명 — 공식 배포 서명이 아니라 Gatekeeper가 거부합니다";
"pipe.devHint" = "내용을 확인하고 체크박스 선택 후 실행하세요";
"pipe.cancelled" = "취소됨";
"pipe.procFail" = "프로세스 실행 실패: %@";
"pipe.launched" = "앱 실행됨";

/* 에러 (error_message_ko.json과 동일) */
"err.inspect" = "차단 속성 조회에 실패했습니다. 경로와 권한을 확인해 주세요.";
"err.remove" = "차단 속성 제거에 실패했습니다. 권한 문제면 앱을 /Applications 밖에서 다시 시도해 주세요.";
"err.sign" = "앱 서명이 손상되었거나 변조가 의심됩니다. 공식 출처에서 다시 받아 주세요.";
"err.gatekeeper" = "Gatekeeper가 실행을 거부했습니다. %@";
"err.launch" = "앱 실행에 실패했습니다. %@";
"err.notapp" = ".app 파일이 아닙니다. %@";
"err.validation" = "입력값이 올바르지 않습니다. %@";

/* 서명 단계 (T-AGO-21~23) */
"step.sign" = "서명";
"sign.askTitle" = "서명하시겠습니까?";
"sign.askBody" = "개발자 신원 %@로 이 앱에 서명합니다. 건너뛰어도 검사는 계속됩니다.";
"sign.skipToggle" = "서명 건너뛰기";
"sign.skipToggleHelp" = "체크 시 서명 확인 창을 띄우지 않고 자동으로 건너뜁니다.";
"pipe.signAutoSkipped" = "서명 건너뛰기 (기본 체크) — 서명 없이 계속합니다.";
"sign.doSign" = "서명하기";
"sign.skip" = "건너뛰기";
"sign.noIdentityTitle" = "서명 신원이 없습니다";
"sign.noIdentityBody" = "서명하려면 Xcode에 Apple ID 로그인이 필요합니다. 로그인 없이도 건너뛰고 계속할 수 있습니다.";
"sign.guide1" = "1. 아래 Xcode 열기를 눌러 Xcode를 엽니다";
"sign.guide2" = "2. 설정 > 계정에서 + 버튼으로 Apple ID를 추가합니다 (무료)";
"sign.guide3" = "3. 다시 확인을 누릅니다. 목록에 뜨면 서명하기를 누르세요";
"sign.manualPlaceholder" = "신원 직접 입력 (예: Apple Development: a@b.c (TEAMID))";
"sign.openXcode" = "Xcode 열기";
"sign.recheck" = "다시 확인";
"sign.noXcode" = "Xcode가 설치되어 있지 않습니다.";
"pipe.identities" = "서명 신원 %d개 발견";
"pipe.signSkipped" = "서명 건너뜀 — 기존 흐름으로 계속합니다";
"pipe.signed" = "서명 완료: %@";
"err.signing" = "앱 서명에 실패했습니다. %@";
"verdict.signed" = "개발자 신원으로 서명됨 (Gatekeeper 평가는 별도)";

/* 업데이트 확인 (v0.2.2) */
"update.badge" = "%@ 사용 가능";
"update.sheetTitle" = "새 버전을 사용할 수 있습니다";
"update.current" = "현재 %@";
"update.latest" = "최신 %@";
"update.notesTitle" = "릴리스 노트";
"update.methodBody" = "1. 다운로드 버튼으로 DMG를 내려받습니다.\n2. DMG를 열고 AGO.app을 응용 프로그램 폴더로 옮깁니다.\n3. 첫 실행 시 \"확인할 수 없습니다\"가 뜨면 우클릭 → 열기로 한 번 열어주세요.";
"update.download" = "다운로드";
"update.later" = "나중에";
"update.check" = "업데이트 확인";
"update.checking" = "확인 중…";
"update.upToDate" = "최신 버전입니다";
"update.noRelease" = "게시된 릴리스가 없습니다";
"update.fetchFailed" = "릴리스를 불러오지 못했습니다";
"update.freqTitle" = "확인 주기";
"update.freqLaunch" = "실행 시";
"update.freqDaily" = "매일";
"update.freqWeekly" = "매주";
"update.freqNever" = "안 함";
